Revit 2027 API
FilledRegion.CreateMaskingRegion Method
Overload List
Name | Description
CreateMaskingRegion(Document, ElementId, IList<CurveLoop>) |  Creates a view-specific masking region from the given boundaries.
CreateMaskingRegion(Document, SketchPlane, IList<CurveLoop>) |  Creates a masking region on a sketch plane in a 3d model family.
Top
See Also
Reference
FilledRegion Class
Autodesk.Revit.DB Namespace